---
kind: type
id: T:Autodesk.Revit.DB.Analysis.HVACLoadBuildingType
source: html/db7c8da2-260f-94b7-990e-f32ad234ec87.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadBuildingType

The type element of building.

## Syntax (C#)
```csharp
public class HVACLoadBuildingType : HVACLoadType
```